title: DNS Query To Suspicious TLD
id: e4845f76-5169-4198-9817-60cc881864db
related:
    - id: e043f529-8514-4205-8ab0-7f7d2927b400
      type: derived
status: experimental
description: |
     Detects DNS query requests to suspicious and low reputation top level domains.
references:
    - https://www.virustotal.com/gui/file/bdc7b917477bb49af7a5b06e5d9ed20e08fed25944f297a6b36a50d03d8a5777
    - https://github.com/mthcht/awesome-lists/blob/main/Lists/suspicious_tlds_list.csv
author: mf1d3l
date: 2024-11-23
tags:
    - attack.command-and-control
    - attack.t1071.004
logsource:
    category: dns_query
    product: windows
detection:
    selection:
        QueryName|endswith: 
            - '.accountant'
            - '.accountants'
            - '.adult'
            - '.am'
            - '.asia'
            - '.autos'
            - '.bar'
            - '.bd'
            - '.best'
            - '.bet'
            - '.bid'
            - '.bio'
            - '.blue'
            - '.buzz'
            - '.cam'
            - '.casa'
            - '.casino'
            - '.cc'
            - '.cd'
            - '.cf'
            - '.cfd'
            - '.charity'
            - '.click'
            - '.club'
            - '.cm'
            - '.cn'
            - '.country'
            - '.cricket'
            - '.cyou'
            - '.dad'
            - '.date'
            - '.degree'
            - '.download'
            - '.earth'
            - '.email'
            - '.faith'
            - '.fit'
            - '.fund'
            - '.futbol'
            - '.fyi'
            - '.ga'
            - '.gdn'
            - '.ge'
            - '.gives'
            - '.gold'
            - '.gq'
            - '.guru'
            - '.haus'
            - '.help'
            - '.homes'
            - '.icu'
            - '.id'
            - '.il'
            - '.in'
            - '.info'
            - '.ink'
            - '.jetzt'
            - '.ke'
            - '.kim'
            - '.lat'
            - '.life'
            - '.link'
            - '.live'
            - '.lk'
            - '.loan'
            - '.lol'
            - '.ltd'
            - '.makeup'
            - '.me'
            - '.men'
            - '.ml'
            - '.mom'
            - '.monster'
            - '.mov'
            - '.ng'
            - '.ninja'
            - '.online'
            - '.party'
            - '.pics'
            - '.pk'
            - '.plus'
            - '.poker'
            - '.porn'
            - '.pro'
            - '.pub'
            - '.pw'
            - '.py'
            - '.quest'
            - '.racing'
            - '.realtor'
            - '.ren'
            - '.rest'
            - '.review'
            - '.rip'
            - '.rocks'
            - '.rodeo'
            - '.ru'
            - '.run'
            - '.sa'
            - '.sbs'
            - '.science'
            - '.sex'
            - '.sexy'
            - '.shop'
            - '.site'
            - '.skin'
            - '.space'
            - '.stream'
            - '.su'
            - '.support'
            - '.th'
            - '.tk'
            - '.tn'
            - '.tokyo'
            - '.top'
            - '.trade'
            - '.tube'
            - '.uno'
            - '.vip'
            - '.wang'
            - '.webcam'
            - '.wiki'
            - '.win'
            - '.work'
            - '.world'
            - '.ws'
            - '.wtf'
            - '.xin'
            - '.xxx'
            - '.xyz'
            - '.zip'
            - '.zone'
            - '.zw'
    filter_optional_chrome:
        Image:
            - 'C:\Program Files\Google\Chrome\Application\chrome.exe'
            - 'C:\Program Files (x86)\Google\Chrome\Application\chrome.exe'
    filter_optional_firefox:
        Image:
            - 'C:\Program Files\Mozilla Firefox\firefox.exe'
            - 'C:\Program Files (x86)\Mozilla Firefox\firefox.exe'
    filter_optional_ie:
        Image:
            - 'C:\Program Files (x86)\Internet Explorer\iexplore.exe'
            - 'C:\Program Files\Internet Explorer\iexplore.exe'
    filter_optional_edge_1:
        - Image|startswith: 'C:\Program Files (x86)\Microsoft\EdgeWebView\Application\'
        - Image|endswith: '\WindowsApps\MicrosoftEdge.exe'
        - Image:
              - 'C:\Program Files (x86)\Microsoft\Edge\Application\msedge.exe'
              - 'C:\Program Files\Microsoft\Edge\Application\msedge.exe'
    filter_optional_edge_2:
        Image|startswith:
            - 'C:\Program Files (x86)\Microsoft\EdgeCore\'
            - 'C:\Program Files\Microsoft\EdgeCore\'
        Image|endswith:
            - '\msedge.exe'
            - '\msedgewebview2.exe'
    filter_optional_safari:
        Image|endswith: '\safari.exe'
    filter_optional_defender:
        Image|endswith:
            - '\MsMpEng.exe' # Microsoft Defender executable
            - '\MsSense.exe' # Windows Defender Advanced Threat Protection Service Executable
    filter_optional_brave:
        Image|endswith: '\brave.exe'
        Image|startswith: 'C:\Program Files\BraveSoftware\'
    filter_optional_maxthon:
        Image|contains: '\AppData\Local\Maxthon\'
        Image|endswith: '\maxthon.exe'
    filter_optional_opera:
        Image|contains: '\AppData\Local\Programs\Opera\'
        Image|endswith: '\opera.exe'
    filter_optional_seamonkey:
        Image|startswith:
            - 'C:\Program Files\SeaMonkey\'
            - 'C:\Program Files (x86)\SeaMonkey\'
        Image|endswith: '\seamonkey.exe'
    filter_optional_vivaldi:
        Image|contains: '\AppData\Local\Vivaldi\'
        Image|endswith: '\vivaldi.exe'
    filter_optional_whale:
        Image|startswith:
            - 'C:\Program Files\Naver\Naver Whale\'
            - 'C:\Program Files (x86)\Naver\Naver Whale\'
        Image|endswith: '\whale.exe'
    filter_optional_tor:
        Image|contains: '\Tor Browser\'
    filter_optional_whaterfox:
        Image|startswith:
            - 'C:\Program Files\Waterfox\'
            - 'C:\Program Files (x86)\Waterfox\'
        Image|endswith: '\Waterfox.exe'
    filter_optional_midori:
        Image|contains: '\AppData\Local\Programs\midori-ng\'
        Image|endswith: '\Midori Next Generation.exe'
    filter_optional_slimbrowser:
        Image|startswith:
            - 'C:\Program Files\SlimBrowser\'
            - 'C:\Program Files (x86)\SlimBrowser\'
        Image|endswith: '\slimbrowser.exe'
    filter_optional_flock:
        Image|contains: '\AppData\Local\Flock\'
        Image|endswith: '\Flock.exe'
    filter_optional_phoebe:
        Image|contains: '\AppData\Local\Phoebe\'
        Image|endswith: '\Phoebe.exe'
    filter_optional_falkon:
        Image|startswith:
            - 'C:\Program Files\Falkon\'
            - 'C:\Program Files (x86)\Falkon\'
        Image|endswith: '\falkon.exe'
    filter_optional_avant:
        Image|startswith:
            - 'C:\Program Files (x86)\Avant Browser\'
            - 'C:\Program Files\Avant Browser\'
        Image|endswith: '\avant.exe'
    condition: selection and not 1 of filter_optional_*
falsepositives:
    - Unlikely
level: low
