title: DelayedExpansion DOS Obfuscation
id: 8a26e6a0-fa6d-4088-b322-c3286e905dbd
status: test
description: |
      Detects the use of the DelayedExpansion Feature in Cmd process invocation command lines that may be indicative of DOS obfuscation. 
references:
    - https://www.virustotal.com/gui/file/939f509a8edc6b9da103fbcebe85630671ed591dd9e40243da37559e10dcfd80
    - https://ss64.com/nt/delayedexpansion.html
author: mf1d3l
date: 2024-11-23
tags:
    - attack.defense-evasion
    - attack.t1027.010 
logsource:
    category: process_creation
    product: windows
detection:
    selection_img:
        - Image|endswith: '\cmd.exe'
        - OriginalFileName: 'Cmd.Exe'
    selection_flags:
        CommandLine|contains|all: 
          - ' /c '
          - ' /v:on '
          - '!'
    condition: all of selection_*
falsepositives:
    - False positives levels will differ Depending on the environment. You can use a combination of ParentImage and other keywords from the CommandLine field to filter legitimate activity
level: low
